Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/edc/PIC32MZ1064DAH176.PIC
      <edc:SFRDef edc:_addr="0x1F8EA8B0" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA44" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA44" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL117" edc:desc="" edc:mask="0xf" edc:name="PIXEL117" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL116" edc:desc="" edc:mask="0xf" edc:name="PIXEL116" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL115" edc:desc="" edc:mask="0xf" edc:name="PIXEL115" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL114" edc:desc="" edc:mask="0xf" edc:name="PIXEL114" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL113" edc:desc="" edc:mask="0xf" edc:name="PIXEL113" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL112" edc:desc="" edc:mask="0xf" edc:name="PIXEL112" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL111" edc:desc="" edc:mask="0xf" edc:name="PIXEL111" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL110" edc:desc="" edc:mask="0xf" edc:name="PIXEL110" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA8B4" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA45" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA45" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1115" edc:desc="" edc:mask="0xf" edc:name="PIXEL1115" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1114" edc:desc="" edc:mask="0xf" edc:name="PIXEL1114" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1113" edc:desc="" edc:mask="0xf" edc:name="PIXEL1113" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1112" edc:desc="" edc:mask="0xf" edc:name="PIXEL1112" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1111" edc:desc="" edc:mask="0xf" edc:name="PIXEL1111" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1110" edc:desc="" edc:mask="0xf" edc:name="PIXEL1110" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL119" edc:desc="" edc:mask="0xf" edc:name="PIXEL119" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL118" edc:desc="" edc:mask="0xf" edc:name="PIXEL118" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA8B8" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA46" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA46" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1123" edc:desc="" edc:mask="0xf" edc:name="PIXEL1123" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1122" edc:desc="" edc:mask="0xf" edc:name="PIXEL1122" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1121" edc:desc="" edc:mask="0xf" edc:name="PIXEL1121" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1120" edc:desc="" edc:mask="0xf" edc:name="PIXEL1120" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1119" edc:desc="" edc:mask="0xf" edc:name="PIXEL1119" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1118" edc:desc="" edc:mask="0xf" edc:name="PIXEL1118" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1117" edc:desc="" edc:mask="0xf" edc:name="PIXEL1117" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1116" edc:desc="" edc:mask="0xf" edc:name="PIXEL1116" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA8BC" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA47" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA47" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1131" edc:desc="" edc:mask="0xf" edc:name="PIXEL1131" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1130" edc:desc="" edc:mask="0xf" edc:name="PIXEL1130" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1129" edc:desc="" edc:mask="0xf" edc:name="PIXEL1129" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1128" edc:desc="" edc:mask="0xf" edc:name="PIXEL1128" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1127" edc:desc="" edc:mask="0xf" edc:name="PIXEL1127" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1126" edc:desc="" edc:mask="0xf" edc:name="PIXEL1126" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1125" edc:desc="" edc:mask="0xf" edc:name="PIXEL1125" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1124" edc:desc="" edc:mask="0xf" edc:name="PIXEL1124" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA8C0" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA48" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA48" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL127" edc:desc="" edc:mask="0xf" edc:name="PIXEL127" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL126" edc:desc="" edc:mask="0xf" edc:name="PIXEL126" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL125" edc:desc="" edc:mask="0xf" edc:name="PIXEL125" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL124" edc:desc="" edc:mask="0xf" edc:name="PIXEL124" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL123" edc:desc="" edc:mask="0xf" edc:name="PIXEL123" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL122" edc:desc="" edc:mask="0xf" edc:name="PIXEL122" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL121" edc:desc="" edc:mask="0xf" edc:name="PIXEL121" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL120" edc:desc="" edc:mask="0xf" edc:name="PIXEL120" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
