Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/edc/PIC32MZ1064DAH176.PIC
    <edc:Pin>
      <!--Pin 113-->
      <edc:VirtualPin edc:name="RJ8"/>
      <edc:VirtualPin edc:name="ETXD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 114-->
      <edc:VirtualPin edc:name="RJ1"/>
      <edc:VirtualPin edc:name="EMDIO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 115-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 116-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 117-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 118-->
      <edc:VirtualPin edc:name="RJ0"/>
      <edc:VirtualPin edc:name="ETXERR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 119-->
      <edc:VirtualPin edc:name="RD11"/>
      <edc:VirtualPin edc:name="RPD11" edc:ppsgroup="2" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="EMDC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 120-->
      <edc:VirtualPin edc:name="RD7"/>
      <edc:VirtualPin edc:name="RPD7" edc:ppsgroup="2" edc:ppsval="14"/>
      <edc:VirtualPin edc:name="ETXCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 121-->
      <edc:VirtualPin edc:name="RD6"/>
      <edc:VirtualPin edc:name="RPD6" edc:ppsgroup="1" edc:ppsval="14"/>
      <edc:VirtualPin edc:name="ETXEN"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 122-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 123-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 124-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 125-->
      <edc:VirtualPin edc:name="RA15"/>
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="RPA15" edc:ppsgroup="2" edc:ppsval="13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 126-->
      <edc:VirtualPin edc:name="RA14"/>
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="RPA14" edc:ppsgroup="1" edc:ppsval="13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 127-->
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="PMD14"/>
      <edc:VirtualPin edc:name="EBID14"/>
      <edc:VirtualPin edc:name="GD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 128-->
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="SDA2"/>
      <edc:VirtualPin edc:name="EBIRDY1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 129-->
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="SCL2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 130-->
      <edc:VirtualPin edc:name="RK7"/>
      <edc:VirtualPin edc:name="EBIA21"/>
      <edc:VirtualPin edc:name="GD19"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 131-->
      <edc:VirtualPin edc:name="RK6"/>
      <edc:VirtualPin edc:name="EBIA20"/>
      <edc:VirtualPin edc:name="GD15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 132-->
      <edc:VirtualPin edc:name="RK5"/>
      <edc:VirtualPin edc:name="EBIA19"/>
      <edc:VirtualPin edc:name="GD14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 133-->
      <edc:VirtualPin edc:name="RK4"/>
      <edc:VirtualPin edc:name="EBIA18"/>
      <edc:VirtualPin edc:name="GD13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 134-->
      <edc:VirtualPin edc:name="RK3"/>
      <edc:VirtualPin edc:name="EBIA17"/>
      <edc:VirtualPin edc:name="GD12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 135-->
      <edc:VirtualPin edc:name="RK2"/>
      <edc:VirtualPin edc:name="PMA3"/>
      <edc:VirtualPin edc:name="AN11"/>
      <edc:VirtualPin edc:name="EBIA3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 136-->
      <edc:VirtualPin edc:name="RK1"/>
      <edc:VirtualPin edc:name="PMA1"/>
      <edc:VirtualPin edc:name="AN38"/>
      <edc:VirtualPin edc:name="EBIA1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 137-->
      <edc:VirtualPin edc:name="RK0"/>
      <edc:VirtualPin edc:name="EBIA16"/>
      <edc:VirtualPin edc:name="GD23"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 138-->
      <edc:VirtualPin edc:name="RH11"/>
      <edc:VirtualPin edc:name="AN37"/>
      <edc:VirtualPin edc:name="EBIRDY2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 139-->
      <edc:VirtualPin edc:name="RH7"/>
      <edc:VirtualPin edc:name="PMA4"/>
      <edc:VirtualPin edc:name="AN36"/>
      <edc:VirtualPin edc:name="EBIA4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 140-->
      <edc:VirtualPin edc:name="RH3"/>
      <edc:VirtualPin edc:name="AN35"/>
      <edc:VirtualPin edc:name="EBIWP"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 141-->
      <edc:VirtualPin edc:name="RH2"/>
      <edc:VirtualPin edc:name="EBIRP"/>
      <edc:VirtualPin edc:name="SDWP"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 142-->
      <edc:VirtualPin edc:name="RJ15"/>
      <edc:VirtualPin edc:name="PMA0"/>
      <edc:VirtualPin edc:name="EBIA0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 143-->
      <edc:VirtualPin edc:name="RJ14"/>
      <edc:VirtualPin edc:name="PMD11"/>
      <edc:VirtualPin edc:name="EBID11"/>
      <edc:VirtualPin edc:name="GD8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 144-->
      <edc:VirtualPin edc:name="RJ13"/>
      <edc:VirtualPin edc:name="PMD13"/>
      <edc:VirtualPin edc:name="EBID13"/>
      <edc:VirtualPin edc:name="GD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 145-->
      <edc:VirtualPin edc:name="RJ12"/>
      <edc:VirtualPin edc:name="EBIBS0"/>
      <edc:VirtualPin edc:name="GD9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 146-->
      <edc:VirtualPin edc:name="RJ10"/>
      <edc:VirtualPin edc:name="EBIBS1"/>
      <edc:VirtualPin edc:name="GD18"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 147-->
      <edc:VirtualPin edc:name="RJ7"/>
      <edc:VirtualPin edc:name="EBICS3"/>
      <edc:VirtualPin edc:name="GEN"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 148-->
      <edc:VirtualPin edc:name="RJ6"/>
      <edc:VirtualPin edc:name="EBICS2"/>
      <edc:VirtualPin edc:name="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 149-->
      <edc:VirtualPin edc:name="RJ5"/>
      <edc:VirtualPin edc:name="EBICS1"/>
      <edc:VirtualPin edc:name="HSYNC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 150-->
      <edc:VirtualPin edc:name="RJ4"/>
      <edc:VirtualPin edc:name="EBICS0"/>
      <edc:VirtualPin edc:name="VSYNC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 151-->
      <edc:VirtualPin edc:name="RJ3"/>
      <edc:VirtualPin edc:name="EBIA22"/>
      <edc:VirtualPin edc:name="GD20"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 152-->
      <edc:VirtualPin edc:name="RJ2"/>
      <edc:VirtualPin edc:name="AN32"/>
      <edc:VirtualPin edc:name="EBIRDY3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 153-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 154-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 155-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 156-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 157-->
      <edc:VirtualPin edc:name="RD15"/>
      <edc:VirtualPin edc:name="SCK6"/>
      <edc:VirtualPin edc:name="AN33"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 158-->
      <edc:VirtualPin edc:name="RD14"/>
      <edc:VirtualPin edc:name="RPD14" edc:ppsgroup="1" edc:ppsval="11"/>
      <edc:VirtualPin edc:name="AN22"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 159-->
      <edc:VirtualPin edc:name="RB14"/>
      <edc:VirtualPin edc:name="SCK3"/>
      <edc:VirtualPin edc:name="AN29"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 160-->
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="AN24"/>
      <edc:VirtualPin edc:name="TCK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 161-->
      <edc:VirtualPin edc:name="RC14"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="RPC14" edc:ppsgroup="1" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="SOSCO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 162-->
      <edc:VirtualPin edc:name="RC13"/>
      <edc:VirtualPin edc:name="RPC13" edc:ppsgroup="2" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="SOSCI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 163-->
      <edc:VirtualPin edc:name="RC15"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="OSC2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 164-->
      <edc:VirtualPin edc:name="RC12"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="OSC1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 165-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 166-->
      <edc:VirtualPin edc:name="VBAT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 167-->
      <edc:VirtualPin edc:name="RB5"/>
      <edc:VirtualPin edc:name="RPB5" edc:ppsgroup="1" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="AN45"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 168-->
      <edc:VirtualPin edc:name="RB10"/>
      <edc:VirtualPin edc:name="RPB10" edc:ppsgroup="1" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="CVREFOUT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 169-->
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="CTED2"/>
      <edc:VirtualPin edc:name="RPB0" edc:ppsgroup="3" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="PGED1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 170-->
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="RPB7" edc:ppsgroup="3" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="AN46"/>
      <edc:VirtualPin edc:name="C1INA"/>
      <edc:VirtualPin edc:name="PGED2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 171-->
      <edc:VirtualPin edc:name="RB12"/>
      <edc:VirtualPin edc:name="AN6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 172-->
      <edc:VirtualPin edc:name="RB2"/>
      <edc:VirtualPin edc:name="RPB2" edc:ppsgroup="4" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="C2INB"/>
      <edc:VirtualPin edc:name="AN1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 173-->
      <edc:VirtualPin edc:name="RB9"/>
      <edc:VirtualPin edc:name="PMA7"/>
      <edc:VirtualPin edc:name="RPB9" edc:ppsgroup="1" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="LVDIN"/>
      <edc:VirtualPin edc:name="AN47"/>
      <edc:VirtualPin edc:name="EBIA7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 174-->
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="PMA5"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="EBIA5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 175-->
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="C1INB"/>
      <edc:VirtualPin edc:name="AN2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 176-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT3" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T2CK" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T6CK" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC3" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC7" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U1RX" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U2CTS" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U5RX" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U6CTS" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI1" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI3" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI5" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS6" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="REFCLKI1" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT4" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T5CK" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T7CK" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC4" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC8" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U3RX" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U4CTS" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI2" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI4" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="C1RX" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="REFCLKI4" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT2" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T3CK" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T8CK" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC2" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC5" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC9" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U1CTS" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U2RX" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U5CTS" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS1" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS3" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS4" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS5" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="C2RX" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT1" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T4CK" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T9CK" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC1" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC6" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U3CTS" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U4RX" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U6RX" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS2" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI6" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="OCFA" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="REFCLKI3" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U3TX" edc:ppsgroup="1" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U4RTS" edc:ppsgroup="1" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO1" edc:ppsgroup="1" edc:ppsval="5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO2" edc:ppsgroup="1" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO3" edc:ppsgroup="1" edc:ppsval="7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO5" edc:ppsgroup="1" edc:ppsval="9"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS6" edc:ppsgroup="1" edc:ppsval="10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC3" edc:ppsgroup="1" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC6" edc:ppsgroup="1" edc:ppsval="12"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="REFCLKO4" edc:ppsgroup="1" edc:ppsval="13"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C2OUT" edc:ppsgroup="1" edc:ppsval="14"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C1TX" edc:ppsgroup="1" edc:ppsval="15"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U1TX" edc:ppsgroup="2" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U2RTS" edc:ppsgroup="2" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U5TX" edc:ppsgroup="2" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U6RTS" edc:ppsgroup="2" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO1" edc:ppsgroup="2" edc:ppsval="5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO2" edc:ppsgroup="2" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO3" edc:ppsgroup="2" edc:ppsval="7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO4" edc:ppsgroup="2" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO5" edc:ppsgroup="2" edc:ppsval="9"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC4" edc:ppsgroup="2" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC7" edc:ppsgroup="2" edc:ppsval="12"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="REFCLKO1" edc:ppsgroup="2" edc:ppsval="15"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U3RTS" edc:ppsgroup="3" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U4TX" edc:ppsgroup="3" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U6TX" edc:ppsgroup="3" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS1" edc:ppsgroup="3" edc:ppsval="5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS3" edc:ppsgroup="3" edc:ppsval="7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS4" edc:ppsgroup="3" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS5" edc:ppsgroup="3" edc:ppsval="9"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO6" edc:ppsgroup="3" edc:ppsval="10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC5" edc:ppsgroup="3" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC8" edc:ppsgroup="3" edc:ppsval="12"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C1OUT" edc:ppsgroup="3" edc:ppsval="14"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="REFCLKO3" edc:ppsgroup="3" edc:ppsval="15"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U1RTS" edc:ppsgroup="4" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U2TX" edc:ppsgroup="4" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U5RTS" edc:ppsgroup="4" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U6TX" edc:ppsgroup="4" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS2" edc:ppsgroup="4" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO4" edc:ppsgroup="4" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO6" edc:ppsgroup="4" edc:ppsval="10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC2" edc:ppsgroup="4" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC1" edc:ppsgroup="4" edc:ppsval="12"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC9" edc:ppsgroup="4" edc:ppsval="13"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C2TX" edc:ppsgroup="4" edc:ppsval="15"/>
    </edc:RemappablePin>
  </edc:PinList>
</edc:PIC>
